{
  "Harry Potter":  [
    "Wer ist Harry Potters Pate?\n",
    "Wie heißt die Schule, die Harry Potter besucht?\n",
    "Wie lauten die Namen von Harry Potters zwei besten Freunden?\n",
    "Wer ist der Schulleiter von Hogwarts?\n",
    "Wie heißt der Zug, der die Schüler nach Hogwarts bringt?\n",
    "Welchen magischen Sport spielen die Charaktere auf Besen?\n",
    "Welches Wesen bewacht den Eingang zur Kammer des Schreckens?\n",
    "Wer ist der Hauptantagonist in der Harry-Potter-Serie?\n",
    "Wie heißt Harrys Eule?\n",
    "Wie heißt der dreiköpfige Hund, der den Stein der Weisen bewacht?\n"

  ],
  "Unidentified flying object":  [
    "Wofür steht das Akronym UFO?\n",
    "Wann wurde der Begriff 'UFO' zum ersten Mal geprägt?\n",
    "Welches Land meldete die erste weit verbreitete UFO-Sichtung im Jahr 1947?\n",
    "In welcher Form werden UFOs üblicherweise beschrieben?\n",
    "Welches Regierungsprojekt untersuchte UFOs von 1952 bis 1969?\n",
    "Welcher US-Bundesstaat ist die Heimat des berühmten UFO-Vorfalls nahe Roswell?\n",
    "Wie heißt die geheime US-Luftwaffenbasis, die oft mit UFO-Theorien in Verbindung gebracht wird?\n",
    "Wer war der Physiker und Ufologe, der das Klassifizierungssystem 'Close Encounters' popularisierte?\n",
    "Welche Art von Beweisen wird häufig bei UFO-Sichtungen zitiert?\n",
    "Welche Regierungsbehörde hat im Jahr 2020 freigegebene UFO-Berichte veröffentlicht?"

  ],
  "Dark Souls (video game)":  [
    "Was ist das Hauptziel in Dark Souls?\n",
    "Wer ist der Spielercharakter in Dark Souls?\n",
    "Welche verschiedenen Klassen stehen in Dark Souls zur Auswahl?\n",
    "Was sind einige der Hauptfeinde oder Bosse, die in Dark Souls auftreten?\n",
    "Was ist die Bedeutung von Lagerfeuern in Dark Souls?\n",
    "Wie kann der Spieler seinen Charakter in Dark Souls aufleveln und verbessern?\n",
    "Was sind einige wichtige Mechaniken im Kampf in Dark Souls?\n",
    "Was sind einige wichtige Unterschiede zwischen Dark Souls und anderen Action-RPG-Spielen?\n",
    "Was ist die Lore oder Hintergrundgeschichte der Dark Souls Welt?\n",
    "Wie funktioniert das Mehrspieler-Gameplay in Dark Souls?"

  ],
  "Final Fantasy VII":  [
    "Wer ist der Hauptprotagonist von Final Fantasy VII?\n",
    "Wie heißt die Stadt, in der der größte Teil des Spiels stattfindet?\n",
    "Wie lautet der Name des Antagonisten in Final Fantasy VII?\n",
    "Wer ist der Anführer der Umweltschutzorganisation AVALANCHE?\n",
    "Wie heißt das Blumenmädchen, das Cloud in den Slums von Sektor 5 trifft?\n",
    "Wie lautet der Name des Schwertes, das Cloud führt?\n",
    "Wie heißt das Luftschiff, das die Gruppe verwendet, um um die Welt zu reisen?\n",
    "Wie lautet der Name der Materia, die es den Charakteren ermöglicht, mächtige Kreaturen herbeizurufen?\n",
    "Wie heißt der Jugendfreund des Hauptcharakters, der eine bedeutende Rolle in der Geschichte spielt?\n",
    "Wie lautet der Name der ultimativen Beschwörungs-Materia im Spiel?"

  ],
  "Olympic Games":  [
    "Wann fanden die ersten modernen Olympischen Spiele statt?\n",
    "Wie oft finden die Olympischen Sommerspiele statt?\n",
    "In welchem Jahr begannen die Olympischen Winterspiele?\n",
    "Welches Land hat die meisten Olympischen Spiele ausgerichtet?\n",
    "Welche Farben haben die olympischen Ringe und was repräsentieren sie?\n",
    "Wie viele Sportarten sind derzeit bei den Olympischen Sommerspielen enthalten?\n",
    "Wer wird als der „Vater der modernen Olympischen Spiele“ bezeichnet?\n",
    "Was ist die Bedeutung der olympischen Flamme und des Fackellaufs?\n",
    "Was ist das olympische Motto und was bedeutet es?\n",
    "Wie viele Medaillen werden insgesamt bei den Olympischen Sommerspielen vergeben?"
  ],
  "Feng shui":  [
    "Was ist Feng Shui?\n",
    "Wie beeinflusst Feng Shui das Leben einer Person?\n",
    "Was sind die grundlegenden Prinzipien von Feng Shui?\n",
    "Wie kann man Feng Shui in sein Zuhause oder seinen Arbeitsplatz integrieren?\n",
    "Was sind einige gängige Feng Shui-Werkzeuge oder Symbole?\n",
    "Wie steht Feng Shui im Zusammenhang mit den Elementen der Natur?\n",
    "Kann Feng Shui helfen, Beziehungen oder Gesundheit zu verbessern?\n",
    "Was sind einige Feng Shui-Tipps zur Förderung von Wohlstand und Reichtum?\n",
    "Wie kann jemand sein Feng Shui-Geburtselement bestimmen?\n",
    "Ist Feng Shui eine Form des Aberglaubens oder hat es wissenschaftliche Grundlagen?"

  ],
  "Diabetes":  [
    "Was ist Diabetes?\n",
    "Was sind die Haupttypen von Diabetes?\n",
    "Was sind die Symptome von Diabetes?\n",
    "Wie wird Diabetes diagnostiziert?\n",
    "Wie wird Diabetes behandelt?\n",
    "Was sind einige Risikofaktoren für die Entwicklung von Diabetes?\n",
    "Kann Diabetes verhindert werden?\n",
    "Gibt es Komplikationen im Zusammenhang mit Diabetes?\n",
    "Wie können Ernährung und Bewegung helfen, Diabetes zu managen?\n",
    "Was ist die Auswirkung von Diabetes auf die allgemeine Gesundheit und das Wohlbefinden einer Person?"
  ],
  "EBay":  [
    "Worauf hat sich eBay hauptsächlich spezialisiert, zu verkaufen?\n",
    "Wie erstellt man ein Konto auf eBay?\n",
    "Was ist der Zweck der Option \"Sofort-Kaufen\" auf eBay?\n",
    "Wie funktioniert das Bieten auf Artikel auf eBay?\n",
    "Was ist der Unterschied zwischen einem Festpreisangebot und einer Auktion auf eBay?\n",
    "Wie kommt PayPal beim Kauf auf eBay ins Spiel?\n",
    "Kann man auf eBay mit den Verkäufern über Preise verhandeln?\n",
    "Was ist das Feedback-System auf eBay und wie funktioniert es?\n",
    "Wie lange hat man Zeit, um für einen Artikel zu bezahlen, nachdem man eine Auktion auf eBay gewonnen hat?\n",
    "Gibt es Gebühren, die mit dem Verkauf von Artikeln auf eBay verbunden sind?"

  ],
  "Obsessive–compulsive disorder":  [
    "Was sind die häufigsten Symptome der Zwangsstörung (OCD)?\n",
    "Wie wird OCD von medizinischen Fachkräften diagnostiziert?\n",
    "Was sind einige häufige Auslöser für OCD-Verhaltensweisen?\n",
    "Was sind die häufigsten Arten von zwanghaften Gedanken, die bei Personen mit OCD auftreten?\n",
    "Was sind einige häufige zwanghafte Verhaltensweisen, die von Personen mit OCD gezeigt werden?\n",
    "Was sind mögliche Ursachen für OCD?\n",
    "Wie beeinflusst OCD das tägliche Leben und die Beziehungen einer Person?\n",
    "Was sind einige wirksame Behandlungsmöglichkeiten zur Bewältigung von OCD-Symptomen?\n",
    "Gibt es Lebensstiländerungen oder Bewältigungsstrategien, die Personen mit OCD helfen können?\n",
    "Was ist der Unterschied zwischen OCD und normalen Gewohnheiten oder Routinen?"

  ],
  "Chronic obstructive pulmonary disease":  [
    "Was ist die chronisch obstruktive Lungenerkrankung (COPD)?\n",
    "Was sind die häufigsten Symptome von COPD?\n",
    "Was sind die Hauptursachen von COPD?\n",
    "Wie wird COPD diagnostiziert?\n",
    "Wie wird COPD behandelt?\n",
    "Welche Lebensstiländerungen können helfen, COPD zu bewältigen?\n",
    "Gibt es Komplikationen im Zusammenhang mit COPD?\n",
    "Kann COPD verhindert werden?\n",
    "Wie ist die langfristige Prognose für Personen mit COPD?\n",
    "Wie trägt Rauchen zur Entwicklung von COPD bei?"

  ]
}